// 1. Створити об’єкт user з наступними властивостями:
// ім'я,
// прізвище,
// електронна адреса,
// password,
// номер телефона,
// адреса (є рядком або *об'єктом з властивостями місто, вулиця, дім, квартира) ;

// 2. Написати функцію, яка приймає об’єкт юзера і виводить вітання типу “Доброго дня, (ім’я_юзера) (прізвище юзера)”

// 3. Написати функцію, яка приймає об’єкт і виводить в консоль всі його властивості (за допомогою циклу for..in)

function showObjects(obj) {
  for (const key in obj) {
    console.log(key, obj[key]);
  }
}

showObjects(customer);

// 4. Створити об’єкт car (машина) з властивостями:
// колір
// модель
// марка
// об’єм двигуна
// місткість (можлива кількість пасажирів)
// поточна швидкість (speed)
// максимальна можлива швидкість (maxSpeed)

// та методами:
// accelerate (збільшення швидкості): метод приймає кількість кілометрів/годину (ціле число) та додає до поточної швидкості (speed), але результат не має перевищувати максимально можливої швидкості для цієї машини

// deaccelerate (зменшення швидкості): метод приймає ціле число (кількість кілометрів на годину) і зменшує поточну швидкість (speed) на вказану, але результат не може бути від’ємним

// stop (зупинка) - метод нічого не приймає, при виклику встановлює поточну швидкість (speed) рівною 0

// 5. На основі об’єкта з завдання №4 розробити функцію-конструктор для масового створення таких об’єктів за переданими параметрами. В якості перевірки створити декілька екземплярів таких об’єктів з різними властивостями
